In [1]:
import pandas as pd

In [2]:
z={'MI':[4],'CSK':[3],'KKR':[2],'SRH':[1]}

In [3]:
a=pd.DataFrame(z)
a

   MI  CSK  KKR  SRH
0   4    3    2    1

In [4]:
a.head(1)

   MI  CSK  KKR  SRH
0   4    3    2    1

In [5]:
b=pd.DataFrame({'MI':[5],'CSK':[8],'KKR':[2],'SRH':[2]})
b

   MI  CSK  KKR  SRH
0   5    8    2    2

In [6]:
y=[a,b]
y

[   MI  CSK  KKR  SRH
 0   4    3    2    1,
    MI  CSK  KKR  SRH
 0   5    8    2    2]

In [ ]:
res=pd.concat()